Revit 2027 API
AlignmentStationLabel.GetAlignmentStationLabels Method
Overload List
Name | Description
GetAlignmentStationLabels(Alignment) |  Returns all alignment station labels placed on the given alignment.
GetAlignmentStationLabels(Alignment, ElementId) |  Returns all alignment station labels placed on the given alignment in the given view.
Top
See Also
Reference
AlignmentStationLabel Class
Autodesk.Revit.DB.Infrastructure Namespace